Repository: nanoy42/django-voting-app
Catalog: src/core/locale/*/LC_MESSAGES/django.po
Languages: fr

source: name
fr: nom

source: begin date
fr: date de début

source: end date
fr: date de fin

source: ready
fr: prêt

source: see voters
fr: voir les votants

source: public results
fr: résultats publics

source: This vote is not open
fr: Le vote n'est pas ouvert

source: This vote is closed
fr: Le vote est fermé

source: You are not allowed to vote in this vote
fr: Vous ne pouvez pas participer à ce vote

source: You already voted for this vote
fr: Vous avez déjà voté pour ce vote

source: text
fr: texte

source: answer
fr: réponse

source: answers
fr: réponses

source: number
fr: nombre

source: ballot
fr: bulletin

source: ballots
fr: bulletins

source: user
fr: utilisateur

source: Legals
fr: Mentions légales

source: Made with ❤ ♦ Version 1.2.1
fr: Fait avec des ❤ ♦ Version 1.2.1

source: Available votes
fr: Votes disponibles

source: Not yet active
fr: Pas encore actif

source: Active
fr: Actif

source: Finished
fr: Fini

source: 1 document available
fr: 1 document disponible

source: Restricted to group :
fr: Groupe autorisé

source: See voters
fr: Liste des votants disponible

source: Yes,No
fr: Oui, Non

source: Public results
fr: Résultats publics

source: The main contributor of django-voting-app is Yoann `nanoy` Piétri.
fr: Le principal contributeur de django-voting-app est Yoann `nanoy` Piétri.

source: Login
fr: Connexion

source: Home
fr: Accueil

source: New vote
fr: Nouveau vote

source: Results
fr: Résultats

source: My groups
fr: Mes groupes

source: Logout
fr: Déconnnexion

source: Name
fr: Nom

source: Name of the vote
fr: Nom du vote

source: Description of the vote
fr: Description du vote

source: Begin date
fr: Date de début

source: In the format YYYY-MM-DDTHH-MM-SS
fr: Au format YYYY-MM-DDTHH-MM-SS

source: End date
fr: Date de fin

source: Groups
fr: Groupes

source: Use Control or Command to select more than one or to unselect.
fr: Utiliser la touche Control ou Command pour sélectionner plusieurs groupes ou les déselectionner.

source: See voters ?
fr: Voir les votants ?

source: Public results ?
fr: Résultats publics ?

source: Add a question
fr: Ajouter une question

source: Add a document
fr: Adjouter un document

source: Submit
fr: Enregistrer

source: Text of question
fr: Texte de la question

source: Add answer
fr: Ajouter une réponse

source: Delete question
fr: Supprimer la question

source: Name of document
fr: Nom du document

source: File of the document
fr: Fichier du document

source: Delete document
fr: Supprimer le document

source: Answer
fr: Réponse

source: Delete answer
fr: Supprimer la réponse

source: Votes with results
fr: Votes avec résultats

source: %(nb_voters)s voters
fr: %(nb_voters)s votants

source: 1 document available
fr: 1 document disponible

source: Please note that the list of voters will be available on the results page (votes are still anonymous)
fr: Veuillez noter que la liste des votants sera disponible sur la page des résultats (les votes sont tout de même anonymes)

source: Please note that the results will be public
fr: Veuillew noter que les résultats seront publics

source: Please note that the following documents are available and may help you in your vote :
fr: Veuillez noter que les documents suivants sont disponibles et qu'ils pourront vous aider à voter

source: Download
fr: Télécharger

source: Please note that once submitted your vote cannot be changed or deleted
fr: Notez qu'une fois le vote effectué, ce dernier ne peut ni être changé ni supprimé

source: All votes
fr: Tous les votes

source: You will find here a recap of all the votes. Whenever a vote is ready, you can click on the big ready. Please note that once a vote is ready, you can't change it or any of the questions.
fr: Vous trouverez ici un résumé de tous les votes. Quand un vote est prêt à être démarré, il faut cliquer sur le bouton "Rendre le vote prêt". Une fois le vote prêt, il n'est plus possible de le modifier lui ni aucune des questions le composant

source: Groups authorised
fr: Groupes autorisés

# plural
source: All
fr: Tous

source: This vote is ready
fr: Le vote est prêt

source: The vote has not yet started
fr: Le vote n'a pas encore commencé

source: The vote is ongoing
fr: Le vote est encore

source: The vote is finished
fr: Le vote est terminé

source: Make the vote ready
fr: Render le vote prêt

source: You voted
fr: Vous avez voté

source: You have not yet voted
fr: Vous n'avez pas encore voté

source: Your ballot is incorrect
fr: Le bulletin est incorrect

source: Thank you for voting
fr: A voté

source: You can't see the results (vote not finished or insufficient rights)
fr: Vous ne pouvez pas voir les résultats avant la fin du vote (vote non terminé ou droits insuffisants)

source: Vote is ready.
fr: Le vote est prêt
