Repository: nanoy42/django-voting-app
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Contents:
fr: Contenu :

source: Welcome to django-voting-app's documentation!
fr: Bienvenue sur la documentation de django-voting-app !

source: This is documentation for django-voting-app version 1.3.0.
fr: Il s'agit de la documentation de la version 1.3.0 de django-voting-app.

source: django-voting-app is small django app tor organize votes.
fr: dajngo-voting-app est une petite application django pour organiser des votes.

source: Here is a quick recap of the functionalities :
fr: Ici un récapitulatif des fonctionnalités :

source: Create votes, with a limited time (time of beginning and time of end)
fr: Créer des votes, dans un intervalle de temps (date et heure de début et date et heure de fin)

source: Restrict votes to groups
fr: Restreindre des votes à des groupes

source: Restrict the access to active members
fr: Restreindre l'accès aux membres actifs

source: Create as many questions and as many possible answers in a vote (no free choice allowed though)
fr: Créer un nombre illimité de questions avec un nombre illimité de responses (pasde champ de réponse libre)

source: Attach documents to a vote
fr: Lier des documents à un vote

source: Votes are anonymous, but it is possible to know who voted (this is required (we could find solution without) to ensure that someone doesn't vote twice)
fr: Les votes sont anonymes mais il est possible de savoir qui a voté dans quel vote(nécessaire pour empêcher que les gens votent deux fois)

source: Translate votes, questions and answers.
fr: Traduire les votes, les questions et les réponses.
