Repository: nanoy42/django-voting-app
Catalog: docs/locale/*/LC_MESSAGES/installation_migration.po
Languages: fr

source: Post-installation and update procedures
fr: Procédures post-installation et de mise à jour

source: After the installation or after an update, you may have to perform additional operation.
fr: Après l'installation, ou après une mise à jour, il peut y avoir des opérations supplémentaires à effectuer.

source: Migrations are all the structural operations on the database. They should be run after an installation.
fr: Les migrations sont les opérations structurelles sur la base de données. Elles doivent être effectuées après l'installation.

source: They should also be run whenever new migrations appears. Migrations can come from :
fr: Elles doivent aussi être réalisées lorsque des nouvelles migrations apparaissent. Cela peut venir :

source: migrations from django
fr: de migrations de django

source: migrations from other dependencies (djanog-modeltranslations for instance)
fr: de migrations d'autre dépendances (django-modeltranslations par exemple)

source: internal migrations.
fr: de migrations internes.

source: Migrations should be run when migrating to
fr: Les migrations doivent être appliqués en mettant à jour vers

source: The command to apply migrations is
fr: La commande pour appliquer les migrations est

source: Migrations are applied automatically when using docker.
fr: Les migrations sont appliquées automatiquement avec l'image docker.

source: Superuser
fr: Super-utilisateur

source: Once the installation finished, you may want to create a super user. You can do it using the command
fr: Une fois l'installation terminée, vous pouvez créer un super-utilisateur avec la commande :

source: and fill in the requested information.
fr: et remplir les informations demandées.

source: Statics
fr: Les fichiers statiques

source: In production statics are **NOT** served by django. You should
fr: En production, les fichiers statiques ne sont **pas** servis par django. Vous devez :

source: Create a directory for static files
fr: Créer un réportoire pour les fichiers statiques

source: Set ``STATIC_ROOT`` to the directory's path in the configuration file
fr: Mettre le paramètre ``STATIC_ROOT`` au chemin du répertoire nouvellement créé.

source: Create an alias for '/static/' to the directory you created in th web server (see apache example configuration file)
fr: Créer un alias pour l'url '/static/' vers le répertoire en question (voir la configuration apache pour exemple).

source: Run the django command to copy static files to the directory
fr: Exécuter la commande django pour copier les fichiers statiques

source: The command to be run is
fr: La commande est

source: Translations
fr: Traductions

source: You can compile the translations files with
fr: Vous pouvez compiler les fichiers de traduction avec cette commande :

source: Example of apache configuration
fr: Exemple de configuration apache

source: When configuring apache, make sure to make alias for the media root and static root. An example of configuration can be found below:
fr: Lors de la configuration d'apache, il ne faut pas oublier de créer un alias pour le répertoire des fichiers statiques et des médias. Un exemple peut être trouvé ci-dessous :

source: Modification of wsgi file to use in virtual env
fr: Modification du fichier wsgi pour les virtualenvs

source: If you are using a virtualenv, a slight modification if the ``wsgi.py`` file is required. This file is located in ``src/django_voting_app``.
fr: Si vous utilisez un virtualenv, il faut légèrement modifier le ``wsgi.py``. Le fichier se trouve dans ``src/django_voting_app``.

source: We suppose that the virtualenv directory is located at ``/var/www/django-voting-app/.venv``.
fr: On suppose ici que le répertoire du virtualenv se trouve au ``/var/www/django-voting-app/.venv``
