Repository: nanoy42/django-voting-app
Catalog: docs/locale/*/LC_MESSAGES/installation_configuration.po
Languages: fr

source: Configuration file
fr: Fichier de configuration

source: The following page describe the structure of the configuration file for django-voting-app. However, for now, you can't edit any value in the docker image for the configuration.
fr: Cette page décrit la structure du fichier de configuration pour django-voting-app. Néanmoins, pour le moment, il est impossible d'éditer n'importe quelle valeur lors de l'installation par docker.

source: The configuration is done in a ``local_settings.py``. You can copy a canvas for this file in the ``src/django_voting_app`` directory :
fr: La configuration est fait dans le fichier ``local_settings.py``. Vous pouvez copier un fichier d'example dpeuis ``src/django_voting_app/local_settings.example.py``.

source: Then you must edit the values in it.
fr: Ensuite, il faut éditer les valeurs dans le fichier.

source: The ``local_settings.py`` is included at the end of the configuration file so you can overwrite **any** django settings, but we encourage to edit only the ones listed in the example local settings file.
fr: Le fichier ``local_settings.py`` est inclus à la fin du fichier de configuration donc il est possible de remplaçer **n'importe quelle valeur** des paramètres. Néanmoins, nous conseillons d'éditer que les valeurs dans le fichier d'exemple, listées ci-après

source: Django settings
fr: Les paramètres relatifs à Django

source: Please see the `django documentation <https://docs.djangoproject.com/fr/3.0/ref/settings>`_ for extended documentation.
fr: Pour plus de détails, merci de se référer à la documentation officielle : <https://docs.djangoproject.com/fr/3.0/ref/settings>`_

source: Default: ``""``
fr: Valeur par défaut : ``""``

source: Django can't run without a secret key.
fr: Django ne démarrera pas sans clé secrète.

source: Default: ``False``
fr: Valeur par défaut : ``False``

source: A boolean that turns on/off debug mode. You should use ``DEBUG=False`` for production.
fr: Un booléen qui active ou désactive le mode débug. En production, il faut utiliser ``False``.

source: Default: ``[]``
fr: Valeur par défaut : ``[]``

source: A list of strings representing the host/domain names that this Django site can serve.
fr: Une liste de chaines de caratères représentant les IPs et domaines sur lesquelsdjango peut tourner.

source: Django can't run with ``DEBUG=False`` and ``ALLOWED_HOSTS=[]``.
fr: Django ne démarrera pas si ``DEBUG=False`` et ``ALLOWED_HOSTS=[]``.

source: A list of tuples representing the admins in the format (name, email).
fr: Une liste de tuples représentant les admins au format (nom, mail)

source: Default:
fr: Valeur par défaut :

source: If you use a postgresql database, on the same host as where you installed django-voting-app, it should look like this:
fr: Si vous utilisez une bade de données postgresql, sur la même machine que django-voting-app, ça devrait ressembler à :

source: Default: ``"UTC"``
fr: Valeur par défaut : ``"UTC"``

source: Time zone of the server.
fr: Fuseau horaire du serveur.

source: Default: ``BASE_DIR / "staticfiles"``
fr: Valeur par défaut : ``BASE_DIR / "staticfiles"``

source: Folder in which the static files should be copied. You should make an alias for ``/static`` to this directory.
fr: Dossier dans lequle les fichiers statics seront copiés. Il faudra faire un alias de ``/static`` vers ce répertoire.

source: Default: ``BASE_DIR / "media"``
fr: Valeur par défaut : ``BASE_DIR / "media"``

source: Folder in which the media files should be uploaded. You should make an alias for ``/media`` to this directory.
fr: Dossier dans lequel les fichiers media sont stockés. Vous devez faire un alais pour ``/media`` vers ce dossier.

source: Model translation settings
fr: Paramètres de modeltranslations

source: django-voting-app uses `django-modeltranslation <https://github.com/deschler/django-modeltranslation>`_ to translate the instances of the models.
fr: django-voting-app utilises `django-modeltranslation <https://github.com/deschler/django-modeltranslation>`_ pour traduire les instaces des modèles.

source: It should work out of the box with the configuration, but if you want to make some modification, there are some parameters worth noting (we, however, redirect you to the full documentation for more parameters and details).
fr: La traduction devrait fonctionner automatiquement sans configuration mais si vous souhaityez faire quelques modifications, il y a quelques paramètres intéressants (voir la documentation officielle pour plus de détails).

source: django-voting-languages supports the following languages :
fr: django-voting-app supporte les langues suivants :

source: English (en)
fr: Anglais (en)

source: French (fr)
fr: Français (fr)

source: To set the default language for your models, you can use
fr: Pour sélectionner la langue par défaut pour vos modèles, vous pouvez utiliser

source: Default: ``"en"``
fr: Valeur par défaut : ``"en"``

source: Also, you may want to use other languages than English and French for your models, that can be done by setting the following attribute:
fr: Aussi, si vous voulez utiliser d'autres langues que l'anglaisou le français, vous pouvez modifier le paramètre

source: Default: ``["en", "fr"]``
fr: Valeur par défaut : ``["en", "fr"]``

source: People will be able to change to any language in ``MODELTRANSLATION_LANGUAGES`` even if the language is not supported by django-voting-app.
fr: Les gens pourront changer vers n'importe quel langage listé dans ``MODELTRANSLATION_LANGUAGES`` même si le langage n'est pas supporté par django-voting-app.

source: django-voting-app settings
fr: paramètres de django-voting-app

source: There are 3 parameters for django-voting-app:
fr: Il y a 3 paramètres pour django-voting-app :

source: Default: ``"Django Voting app"``
fr: Valeur par défaut : ``"Django Voting app"``

source: This text is displayed in the navbar and in the tab name.
fr: Ce texte est affiché dans la barre de naviguation et dans l'onglet.

source: If set to True, staff can see the results of a vote before its end.
fr: Si mis à True, le staff ne peut voir les résultats qu'une fois le vote fini.

source: Default: empty string
fr: Valeur par défaut : chaine de caractère vide

source: Text displayed on the legals page. If it is an empty string, the section is not displayed.
fr: Texte affiché sur la page des mentions légales. Si la valeur est une chaine vide, al section n'est pas affichée.

source: Link to LDAP
fr: Liaison avec le LDAP

source: This app was initially developed to be plugged to LDAP, and make a voting app for an organization.
fr: À la base, cette application a été développée pour être lié au LDAPet faire un système de vote dans une association.

source: This is totally independent of django-voting-app but here is an example of how you can do it.
fr: C'est totalement indépendant de django-voting-app mais voilà un example de comment faire.

source: Install the `django-auth-ldap <https://github.com/django-auth-ldap/django-auth-ldap>`_ package and configure it like so
fr: Installer le paquet `django-auth-ldap <https://github.com/django-auth-ldap/django-auth-ldap>`_ et le configurer ainsi
