Repository: nanoy42/django-voting-app
Catalog: docs/locale/*/LC_MESSAGES/installation_prerequisites.po
Languages: fr

source: Prerequisites
fr: Prérequis

source: Requirements
fr: Prérequis

source: There are currently two ways of installing django-voting-app :
fr: Il y a actuellement deux moyens d'installer django-voting-app :

source: by source
fr: par les sources

source: with docker
fr: avec docker

source: Installation with docker is considered experimental for now.
fr: L'installation avec docker est considérée comme expérimentale pour le moment.

source: If you want to install using the source, you need :
fr: Pour l'installation via les sources, il faut :

source: a web server (apache or nginx for instance)
fr: un serveur web (apache ou nginx par exemple)

source: a database
fr: une base de données

source: If you want to use docker you only need a working docker installation.
fr: Si vous voulez installer avec docker il faut juste une installation docker en état de marche.

source: Database
fr: Base de données

source: You will need a working database for this project. We recommend the use of PostgreSQL but any database working with django (see `here <https://docs.djangoproject.com/en/3.1/ref/databases/>`_) will do the trick.
fr: Il faut une base de données pour faire fonctionner django-voting-app. Nous recommandons l'usage de PostgreSQL mais n'importe quelle base de données compatible avec django peut être utilisé (voir `ici <https://docs.djangoproject.com/en/3.1/ref/databases/>`_).

source: You will need to create, before installation, a database (e.g. django-voting-app) and a user (e.g. django-voting-app) with some password that we will denote ``secret`` for the rest of this guide.
fr: Il faudra créeer, en premier lieu, une base de données (par exemple django-voting-app) et un utilisateur (django-voting-app pour changer) avec un certain mot de passe qu'on considerera comme étant ``secret`` pour la suite de ce guide.

source: This is an example with PostgreSQL syntax :
fr: Voici un exemple de syntaxe PostgreSQL pour les opérations ci-dessus :
