Repository: nanoy42/django-voting-app
Catalog: docs/locale/*/LC_MESSAGES/site_administration.po
Languages: fr

source: Site Administration
fr: Administration du site

source: Self diagnostic page
fr: Page de vérification

source: The site now includes a basic self diagnostic page to see :
fr: Le site contient maintenant une page de vérification qui permet de voir

source: the version of django-voting-app (and if a new version is available)
fr: la version de django-voting-app (et si une nouvelle version est disponible)

source: the media folder configuration
fr: la configuration du dossier média

source: translations configuration
fr: la configuration des traductions

source: dependencies
fr: les dépendances

source: Updater
fr: Script de mise à jour

source: The update script was introduced in version 1.3.0.
fr: Le script de mise à jour a été introduit dans la version 1.3.0.

source: It allows a user to update django-voting-app using a script.
fr: Il permet à l'utilisateur de mettre à jour django-voting-app en utilisant un script.

source: Some remarks:
fr: Quelques remarques

source: By default, it will prevent a user to update when major changes are detected. This behavior can be overwritten with the `-f` (`--force`) option. It is probably better to make a manual update in this case.
fr: Par défaut, la mise à jour avec des modificateurs majeures sera empêchée. Ce comportement peut être changé avec l'option `-f` (`--force`). Il est néanmoins préférable de faire la mise à jour manuellement dans ce cas.

source: By default, it will prevent a user to update if the current branch is not main. It can be overwritten with the `-f` (`--force`) option if you know what you are doing.
fr: Par défaut, la mise à jour depuis une branche qui n'est pas la branche main sera empêchée. Ce comportement peut être changé avec l'option `-f` (`--force`) si vous savez ce que vous faites.

source: The other option to the script is `-h --help` that will display the help screen.
fr: L'autre option du script est `-h --help` qui affiche le message d'aide.

source: This feature is tagged as experimental from version 1.3.0 and onwards.
fr: Cette fonctionnalité est marquée comme expérimentale sur les versions 1.3.0 et suivantes.
