Repository: nanoy42/django-voting-app
Catalog: docs/locale/*/LC_MESSAGES/vote_administration.po
Languages: fr

source: Administration guide
fr: Guide d'administration

source: This guide targets the administrators that want to know how to create votes, questions and answers on django-voting-app.
fr: Ce guide vise les administrateurs qui veulent savoir comment créer des votes, des questions et des réponses sur django-voting-app.

source: All the described operations can be done in the admin panel (accessible with the ``/admin`` url or by clicking on your username and then Admin).
fr: Toutes les opérations décrites ci-dessous peuvent être faites sur l'interface d'administration (accesible avec l'url ``/admin`` ou en cliquant survotre pseudo puis sur Admin).

source: Create votes, questions an answers
fr: Creation des votes, questions et réponses

source: You can create votes ont the admin panel. You need to specify
fr: Vous pouvez créer des votes sur l'interface d'aministration. Vous devez spécifier :

source: a name
fr: un nom

source: a begin date
fr: une date de début

source: a end date
fr: une date de fin

source: if voters will be displayed on the results page
fr: oui si les votants doivent être affichés sur la page de résultats

source: if the results are public (i.e. can be accessed by non staff members)
fr: oui si les résultats doivent être publics (qui peuvent être vus par des personnes non staff)

source: The see_voters option will only be editable when creating the vote and not editing it afterwards.
fr: L'option see_voters est éditable à la création du vote et ne sera pas éditable après.

source: You can optionally add :
fr: Optionnellement, vous pouvez ajouter :

source: a description
fr: une description

source: restrictions on groups
fr: des restrictions relatives aux groupes

source: translation of some fields (see the related section)
fr: des traductions pour certains champs (voir le paragraphe correspondant)

source: The restriction to a specific vote is made using groups. If you specify one (or more) group(s) the user must be in one the groups in order to access the vote. If you don't specify any group, any (active) user can access the vote.
fr: Les restrictions sur un vote spécifique sont faites en utilisant des groupes. Si vous renseignez un ou plusieurs groupes, l'utilisateur doit être dans un des groupes au moins pour avoir accès au vote. Si vous ne spécifiez aucun groupe, tous les utilisateurs actifs auront accès au vote.

source: User who are not active can't connect to the interface.
fr: Les utilisateurs non actifs me peuvent pas se connecter à l'interface.

source: A vote is accessible to a user if the 3 following conditions are met :
fr: Un vote est accessible à un utilisateur si les trois conditions suivantes sont réunies :

source: the vote has begun (i.e. the begin date is passed) and has not yet ended (i.e. the end date is not passed)
fr: le vote a commencé (i.e. la date de départ est passé) et n'est pas fini (i.e. la date de fin n'est pas passé).

source: the vote is ready (see related section)
fr: le vote est prêt (voir la estion correspondante).

source: the user has the right of vote for this vote (i.e. he has not yet voted and the conditions on groups are met)
fr: le votant a le droit de vote pour ce vote (i.e. il n'a pas encore voté et les conditions sur les groupes sont remplies).

source: For each vote, you can create an unlimited number of questions. On the voting page, all questions will be displayed and the user must answer to every one of them.
fr: Pour chaque vote, vous pouvez créer un nombre illimité de questions. Sur la page de vote, chaque questions sera affichée et le votant devra choisir une unique réponse pour chaque question.

source: If you want your users to be able to skip a question of the vote, you can always add a "don't know" answer.
fr: Si vous voulez que vos utilisateurs puissent passer une question, vous pouvez toujours créer une réponse "Ne se prononce pas"

source: You can create questions on the admin panel. You need to specify :
fr: Vous pouvez créer des questions sur le panneau d'administration. Vous devez spécifier :

source: a related vote
fr: a un vote lié

source: a text, which is the question
fr: un texte, qui est la question

source: Additionally you can add :
fr: Optionnellement, vous pouvez ajouter :

source: translations for some fields (see the related section)
fr: des traductions pour certains champs (voir la section correspondante)

source: A question must be related to a unique vote.
fr: Une question doit être liée à un unique vote.

source: It is a bad idea to change the vote of an answer afterwards (after the vote has begun to be more precise). You will get wrong results if you do so.
fr: C'est une mauvaise idée de changer le vote d'une question après (après que vote ait commençé pour être précis). Vous aurez des mauvais résultats si vous le faites.

source: Answers
fr: Questions

source: For each question, you can create an unlimited number of answers. Users will have to select a unique answer for each question.
fr: Pour chaque question, vous pouvez créer un nombre illimité de réponses. Les votants pourront selectionner une seule réponse par question.

source: You can create answers on the admin panel. You need to specify :
fr: Vous pouvez créer des réponses sur le panneau d'aministration. Il faut spécifier :

source: a related question
fr: la question liée

source: the answer
fr: la réponse

source: translations for some fields (see the related section).
fr: des traductions pour certains champs (voir le paragraphe correspondant).

source: An answer must be related to a unique question.
fr: Une réponse doit être liée à une unique question.

source: It is a bad idea to change the question of an answer afterwards (after the vote has begun to be more precise). You will get wrong results if you do so.
fr: C'est une mauvaise idée de changer une question ou une réponse après coup (après que le vote ait commencé pour être précis). Vous aurez des faux résultats si vous le faites.

source: Documents are files to help people vote. There are displayed on the voting page.
fr: Les documents sont des fichiers pour aider les personnes à votes. Ils sont affichés sur la page de vote.

source: For each vote, you can link an unlimited number of documents. A document is related to a unique vote.
fr: Pour chaque vote, il est possible de lier u nombre illimité de documents. Un document lui est lié à un unique vote.

source: You can create documents on the admin panel. You need to specify :
fr: Vous pouvez créer les documents sur le panneau d'administration. Il faut spécifier :

source: a vote
fr: un vote

source: a file
fr: un fichier

source: Readyness
fr: Être prêt

source: Votes will not begin if they are not ready. In fact they will not be displayed on available votes.
fr: Un vote ne commençera pas s'il n'est pas prêt. En vérité un vote non prêt ne sera même pas affiché sur la liste des votes disponibles.

source: When you make a vote ready, you should no longer make any modification. The app will prevent you from doing certain modification but not all of them.
fr: Lorsqu'un vote est rendu prêt, il ne doit plus subir aucune modification. L'app empêchera certaines des modifications mais pas toutes.

source: When a vote is ready, you cannot make the vote not ready again (you have to delete it and start again).
fr: Lorsqu'un vote a été rendu prêt, il n'est plus possible de revenir en arrière (il faut le supprimer et recommençer).

source: To make a vote ready, you can use the action ont the admin panel or go to the administrators index of votes.
fr: Pour rendre un vote prêt, il est possible d'utiliser l'action dans lepanneau d'administration ou d'aller sur l'index administratifs des votes.

source: See results
fr: Voir les résultats

source: Depending on ``VOTE_SEE_BEFORE_END`` you will be able to see the results as the vote goes or when the vote is passed.
fr: Selon la valeur du paramètre ``VOTE_SEE_BEFORE_END``, il sera possible de voir les résultats en temps réel ou seulement après le vote.

source: You can see the results of all the votes on the corresponding page.
fr: Il est possible de voir les résultats de tous les votes sur la page correspondante.

source: Only administrators can see the results.
fr: Seuls les administrateurs peuvent voir les résultats.

source: A note on translations
fr: Un point sur les traductions

source: Some fields may be translated to another languages. By default you can translate to any languages supported by the app, namely
fr: Certains champs peuvent être traduits dans d'autres langues. Par défaut, vous pouvez traduire dans les langues supportées par django-voting-app, soit :

source: en (English)
fr: en (Anglais)

source: fr (French)
fr: fr (Français)

source: If you want more (or less) languages, you can edit the ``MODELTRANSLATION_LANGUAGES`` parameter.
fr: Si vous voulez plus (ou moins) de langues, vous pouvez modifier la valeur de ``MODELTRANSLATION_LANGUAGES``.

source: The following fields can be translated :
fr: Les champs suivants peuvent être traduits :

source: Model
fr: Modèle

source: Translatable fields
fr: Champs traduisibles

source: name, description
fr: nom, description

source: text
fr: texte

source: Answer
fr: Réponse

source: answer
fr: réponse

source: name, document
fr: nom, document

source: Dynamic vote creation
fr: Création dynamique de votes

source: In addition to the previous documentation, it is possible from version 1.3.0 to create the vote, the questions, the answers and the documents using a single web page.
fr: En plus de la documentation précédente, il est possible depuis la version 1.3.0 de créer un vote, les questions, les répones et les documents avec un unique formulaire.

source: This is only accessible to staff member. The remarks are the same as before.
fr: Cette page est accessible seulement par des admins. Les remarques sont les mêmes que précedemment.

source: This is tagged as experimental on version 1.3.0 and onwards.
fr: Cette fonctionnalité est marquée comme expérimentale sur les versions 1.3.0 et suivantes.
